#define _CRT_SECURE_NO_WARNINGS 1
#if 1

#include <stdio.h>
#include <stdlib.h>

//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
int main()
{
	int a = 0, b = 0, c = 0, d = 0, e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)  //五个选手
					{
						if ((2 == b && 3 != a) || (2 != b && 3 == a) == 1)  //A选手说法
						{
							if ((2 == b && 4 != e) || (2 != b && 4 == e) == 1)  //B选手说法
							{
								if ((1 == c && 2 != d) || (1 != c && 2 == d) == 1)  //C选手说法
								{
									if ((5 == c && 3 != d) || (5 != c && 3 == d) == 1)  //D选手说法
									{
										if ((4 == e && 1 != a) || (4 != e && 1 == a) == 1)  //E选手说法
										{
											if (((a != b) && (a != c) && (a != d) && (a != e))
												&& ((b != c) && (b != d) && (b != e))
												&& ((c != d) && (c != e))
												&& ((d != e)))  //五个选手一人一个名次
											{
												printf("a= %d, b= %d,c= %d,d= %d,e= %d\n", a, b, c, d, e);
											}
										}
									}
								}
							}
						}
					}
				}
			}
		}
	}

	system("pause");
	return 0;
}

#endif